# 2) კომენტარებით ახსენით რა არის sequences, iteration და selection. მოიყვანეთ მათი მაგალითები

# sequences არის კოდის თანმიმდევრობა რომლის მიხედვითაც მოხდება მისი შესრულება 
# iteration არის კოდის განმეორება, კოდის გარკვეული ნაწილის ციკლირება
# selection არის არჩევანი, რომლის მიხედვითაც მოხდება ორი ვარიანტიდან რომელიმეს არჩვა

# 3) კომენტარებით ახსენით, რა არის ალგორითმი და ჩამოთვალეთ რა გზები არსებობს მის წარმოსადგენად

# ალგორითმი არის მოქმედების თანმიმდევრობა რომელიც კონკრეტული ამოცანის გაადვილებისას გამოიყენება
# ანუ ანბიჯ ნაბიჯ ინსტრუქცია მიზნის მისაღწევად

# 4) შეეცადეთ თქვენით მიხვდეთ, თუ რა პასუხს გამოიტანს შემდეგი კოდი:

# print(True or False and False or True and False or False and False or False and True and False or True)

# True

# 5) მომხმარებელს შემოატანინეთ რიცხვი და თუ ის არის ლუწი და არის 10-ზე მეტი, ან ტოლია 7-ის, დაბეჭდეთ True

I=int(input("enter a number "))

if I %2 == 0 or I == 7:
    print("true")

# 6) ივარჯიშეთ შემდეგ ფუნქციებზე: int, str, float, bool. თითოეულზე გააკეთეთ 3-3 მაგალითი

10
12
0.2
1

str(12)
str(0.2)
str(1)

int(10)
int(0.2)
int(1)

float(10)
float(12)
float(1)

bool(10)
bool(12)
bool(0.2)

# 7) მომხმარებელს შემოატანინეთ წელი და შეამოწმეთ, თუ ის არის ნაკიანი დაბეჭდეთ
# "This is leap year".(ნაკიანი წელიწადი იყოფა 4-ზე და არ იყოფა 100-ზე ან იყოფა 400-ზე)

year = int(input("enter a year "))


if year % 4 == 0 and year % 100 != 0  or year % 400 == 0:
    print("this is a leap year")
else:
    print("this is not a leap year")