
# 1) შექმენით უსასრულო for loop

#none

# 2) გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით

name=input("enter name ")

for I in range (0, 10, 1):
    print(name)

# 3) შექმენით for loop და კომენტარად მიაწერეთ რომელია თავი და რომელი სხეული


#        head
for I in range (0, 10, 1):
    
    
#   body  
    print(name)

#4) მომხმარებელს შემოაყვანინეთ რიცხვი, სანამ ეს რიცხვი არ იქნება 100-ზე მეტი მაქამდე თავიდან მოთხოვთ რიცხვის შემოტანა

#none


# 5) მომხმარებელს შემოატანინეთ სხვადასხვა სახელები 5-ჯერ იტერაციის მეშვეობით,
# შექმენით ამ სახელებისთვის ცვლადი რომელშიც ყოველი სახელი დაემატება და ეს სახელები გამოიყოფა მძიმეებით,
# ანუ თქვენი ცვლადი 5 სახელის შეყვანის შემდეგ უნდა გამოიყურებოდეს ასე: "{სახელი პირველი}, {სახელი მეორე}, ... {სახელი მეხუთე}" 


user_name_1=input("enter your name ")

for I in range (1, 5 ,1):
    user_name_1=user_name_1+(", ")+ input("enter your name ")
    

print(user_name_1)