// 11. დაბეჭდე 10–დან 1-მდე რიცხვები უკუღმა.

for (let i = 10; i > 1; i--){
    console.log(i)
}

// 12. for loop-ით იპოვე 1–50-მდე კენტი რიცხვები.

for (let i = 1; i < 50; i++){
    if(i % 2 === 1){
        console.log(i)
    }
}

// 13. for loop-ით დაითვალე 5-ის ჯერადები 1–30-მდე.

for (let i = 1; i < 30; i++){
    if(i % 5 === 0){
        console.log(i)
    }
}

// 14. მასივში ([3,6,9,12]) გამოთვალე ელემენტების ჯამი.

//    -

// 15. მასივიდან (["js","html","css"]) for loop-ით დაბეჭდე ინდექსები + მნიშვნელობები.

//    -