# 1) მომხარებელს შემოატანინეთ სახელი და ასაკი და დაპრინტეთ შემდეგ ფორმატში: "Name: სახელი, Age: ასაკი"

name=input()
age=input()

print(name)
print(age)

# 2) მომხმარებელს შემოატანინეთ ორი რიცხვითი მნიშვნელობა (სიგანე და სიმაღლე). ტერმინალში გამოიტანეთ ფართობი/პერიმეტრი.
# S = ფართობი (S = width*height)/P = პერიმეტრი (P = (width+height)*2

height=int(input())
width=int(input())

S=(width*height)
P=(width+height)*2

print(S)
print(P)

# 3) კომენტარების სახით ახსენი რა არის input და output

# input არის ის ინფორმაცია რაც შედის კოდში მის გარედან, მაგალითად განათების დონე, ჰაერის დამტვრიანება, ჩვენი ასაკი ან სახელი
# output არის ის ინფორმაცია რაც გამოდის კოდიდან, მაგალითად სინათლის ჩართვა, ჰაერის გაწმინდვა, საიტზე შესვლის აკრძალვა თუ სრულწლოვანი არ ვართ

# 4) შემოატანინეთ მომხმარებელს ორი რიცხვი და დაპრინტეთ მათი ჯამი, სხვაობა, ნამრავლი და განაყოფი.

num_1=int(input())
num_2=int(input())

print(num_1+num_2)
print(num_1-num_2)
print(num_1*num_2)
print(num_1/num_2)