# 1)შექმენით tuple სახელით fruits სადაც იქნება 5 ხილის სახელი. გამოიტანეთ ირველი ელემენტი ბოლო ელემნტი შუა ელემენტი.

fruits=("apple","pineapple","orange","watermelon","mango")

print(fruits[0])
print(fruits[2])
print(fruits[4])

# 2)შექმენით Tuple -ი და სეცვალეთ მეორე ინდექსზე მყოფი ელემენტი ზუსტად ისე როგორც გაკვეთილზე განახეთ,
# სბოლოოდ გამოპრინტეთ ახალი tuple ელემენტ შეცვლილი. ახსენით კომენტარებით რომელ ხაზზე რა ხდება.

X=(1,2,3,4,5,6)
Y=list(X)
Y[1]=10
X=tuple(Y)

print(X)

# 3) გააერთიანეთ tuple დაწერეთ ორი tuple და გააერთიანეთ და დაბურნეთ გაერთიანება ასევე გააკეთეთ ერთერთი tuple ის გამრავლება სასურველ რიცხვზე.

X=(1,2,3,4,5,6)
Y=(10,11,12,13)
print(X+Y)
print(X*3)

# 4) შექმენი tuple (1,2,3,4,5,6,6,6,67,8) დაწერეთ რამდენჯერ გვხვდება 6 იანი  და რომელ ინდექსზეა 67-ი.

I=0
P=(1,2,3,4,5,6,6,6,67,8)
if 6 in P:
    I=+1
print(I)
print(P[8])