# 1) შექმენი ორი ტაპლი ერთი შეიცავს ციფრებს, მეორე  ფერებს. შემდეგ შექმენი ახალი ტაპლი, რომელიც აერთიანებს ორივეს.

X=(1,2,3,4,5)
Y=("red","yellow","blue")

print(X+Y)

# 2) შექმენი Tuple  და შეამოწმე ტაპლში არის თუ არა კონკრეტული ელემენტი.
print()

I=0
P=(1,2,3,4,5,6,)

if 1 in P:
    I+=1
print(I)

# 3)შექმენი Tuple რიცხვებით. დაბეჭდე მხოლოდ ლუწი რიცხვები for ციკლის გამოყენებით.
print()
I=0
O=(1,2,3,4,5,6,7,8,9,10)

for I in O:
    if I%2 == 0:
        print(I)

# 4) გააკეთეთ ეს ამოცანა:
# იპოვე ლუწი რიცხვები და მიიღე ქულები!
# წესები:
# მოცემულია რიცხვების Tuple (3, 6, 8, 1, 9, 12, 4).
# ლუწი რიცხვი არის ისეთი, რომელიც 2-ზე უნაშთოდ იყოფა.
# ყოველი ლუწი რიცხვის პოვნაზე მიიღებ 1 ქულას.
# დაბეჭდე ლუწი რიცხვები და ბოლოს აჩვენე, რამდენი ქულა დააგროვე.
# ახსენით დავალება კომენტარებით.
print()

Q=0
I=0
R=(3, 6, 8, 1, 9, 12, 4)

for I in O:
    if I%2 == 0:
        print(I)
        Q+=1

print("you got")
print(Q)