# 1)ოცემულია სეტი A = {1, 2, 3, 4, 5}.
# დაწერე ამ სეტის ელემენტების რაოდენობა.
# ჩაწერე, არის თუ არა 3 სეტის ელემენტი.
# დაამატე რიცხვი 6 ამ სეტში.
# ამოიღე რიცხვი 2 სეტიდან.


A = {1, 2, 3, 4, 5}

print(len(A))

print(A)
print("yes there is 3 in set A")

A.add(6)

A.remove(2)

# 2)მოცემულია ორი სეტი: A = {1, 2, 3} და B = {3, 4, 5}.
# იპოვე ამ სეტების გაერთიანება.
# იპოვე ამ სეტების გადაკვეთა.
# იპოვე სეტ A-დან ის ელემენტები, რომლებიც არ ეკუთვნის სეტ B-ს.

A = {1, 2, 3} 
B = {3, 4, 5}

print(A.union(B))
print(A.intersection(B))
print(A.difference(B))

# 3)მოცემულია სეტები A = {a, b, c} და B = {b, c, d}. იპოვე A და B-ის სიმეტრიული სხვაობა.

A = {"a","b","c"}
B = {"b","c","d"}

print(A.symmetric_difference(B))

# 4)შექმენი სეტი
# გამოიყენე შესაბამისი მეთოდი ისე, რომ სეტი გახდეს ცარიელი.
# ამოიბეჭდოს მიღებული სეტი.

A={1,5,7,3,4}

print(A)
print(A.clear())

# 5)შექმენით სეტი და შეინახეთ ელემენტები სასურველი რაოდენობით, შემდეგ კი შექმენით მეორე და საბოლოდ მობეჭდეთ სხვაობა ამ სეტებს შორის.

A={7,9,4,2,6}
B={1,3,6,4,8}

print(A.difference(B))